Repository: flowsydev/flowsy-net-db-sql
Catalog: Flowsy.Db.Sql/Resources/Strings.*.resx
Languages: es

# NoConnectionConfigurationProvided
source: No connection configuration was provided.
es: No se proporcionó ninguna configuración de conexión.

# InvalidConnectionKey
source: Invalid connection key: {0}.
es: Identificador de conexión no válido: {0}.

# CouldNotGetConnection
source: Could not get a database connection.
es: No se pudo obtener una conexión de base de datos.

# CouldNotSetValueXForParameterX
source: Could not set value '{0}' for parameter {1}.
es: No se pudo establecer el valor '{0}' para el parámetro {1}.

# CouldNotParseValueX
source: Could not parse value: {0}
es: No se pudo procesar el valor: {0}

source: Initialization statement executed
es: Comando de inicialización ejecutado

# ConnectionFactoryOrConfigurationListWasExpected
source: A connection factory or a connection configuration list was expected.
es: Se esperaba una fábrica de conexiones o una lista de configuración de conexiones.

# NoMigrationConfigurationProvidedForConnectionWithKey
source: No migration configuration was provided for connection with key
es: No se proporcionó ninguna configuración de migración para la conexión con identificador

# CouldNotCreateDatabaseConnectionForConfigurationWithKey
source: Could not create a database connection for configuration with key
es: No se pudo crear una conexión de base de datos para la configuración con identificador

source: Database migration failed for connection with key
es: La migración de base de datos falló para la conexión con identificador

# MustBeginWorkByInvokingMethodX
source: Must begin work by explicitly invoking the method {0}.
es: Debe iniciarse el trabajo invocando explícitamente el método {0}.

# NoOptionsRegisteredForX
source: No options registered for {0}.
es: No se registraron opciones para {0}.
